/***********************************/
/*				   */
/* Code by: Khromov Egor Pavlovich */
/* github.com/SochnoeAnime/LABScpp */
/*		12.2021		   */
/*				   */
/***********************************/
#include <iostream>
#include <string>

using namespace std;

string ToWords(int numb);

int main()
{
    setlocale(LC_ALL, "Russian");
    string numb;
    cin >> numb;
    string str = ToWords(stoi(numb));
    cout << numb << " = " << str;

    return 0;
}

string ToWords(int numb) {

    int rank[11] = { 0,1,10,100,1000,10000,100000,1000000,10000000,100000000,1000000000};

    string basis[11][10] = {
        {"","","","","","","","","",""},
        {"","один","два","три","четыре","пять","шесть","семь","восемь","девять"},
        {"","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"},
        {"","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"},
        {"","одна","две","три","четыре","пять","шесть","семь","восемь","девять"},
        {"","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"},
        {"","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"},
        {"","один","два","три","четыре","пять","шесть","семь","восемь","девять"},
        {"","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"},
        {"","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"},
        {"","один","два","три ","четыре","пять","шесть","семь","восемь","девять"} };

    string ending[10][10] = {
        {"","","","тысяч","","","миллионов","","","миллиардов"},
        {"","","","тысяча","","","миллион","","","миллиард"},
        {"","","","тысячи","","","миллиона","","","миллиарда"},
        {"","","","тысячи","","","миллиона","","","миллиарда"},
        {"","","","тысячи","","","миллиона","","","миллиарда"},
        {"","","","тысяч","","","миллионов","","","миллиардов"},
        {"","","","тысяч","","","миллионов","","","миллиардов"},
        {"","","","тысяч","","","миллионов","","","миллиардов"},
        {"","","","тысяч","","","миллионов","","","миллиардов"},
        {"","","","тысяч","","","миллионов","","","миллиардов"} };

    string dec[10] = { "десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
    string result;

    if (!numb) {
        result = "ноль";
        return result;
    }
    int numb_copy = numb;
    int rank_count = 0;

    while (numb) {
        numb /= 10;
        ++rank_count;
    }
    int int_part = 0;

    while (numb_copy) {
        if (!((rank_count + 1) % 3)) {
            if ((numb_copy / rank[rank_count]) == 1) {
                numb_copy %= rank[rank_count];
                --rank_count;
                int_part = numb_copy / rank[rank_count];
                numb_copy %= rank[rank_count];
                result += dec[int_part];
                --rank_count;
                if (!(rank_count % 3))
                    result += " " + ending[0][rank_count] + " ";
            }
            if (!rank_count) break;
        }
        int_part = numb_copy / rank[rank_count];
        numb_copy %= rank[rank_count];
        result += basis[rank_count][int_part] + " ";
        --rank_count;
        if (!(rank_count % 3))
            result += ending[int_part][rank_count] + " ";
    }

    return result;
}
